import React from 'react';

export default function TermsOfUsePage() {
  return (
    <div className="container mx-auto py-12 px-4">
      <h1 className="text-3xl font-bold mb-6">Όροι Χρήσης</h1>
      <div className="prose prose-lg max-w-none">
        <h2 className="mt-20">1. Πνευματικά Δικαιώματα</h2>
        <p>
          Όλο το περιεχόμενο της ιστοσελίδας, συμπεριλαμβανομένων αλλά όχι περιοριστικά, κειμένων,
          λογοτύπων, εικόνων, βίντεο και γραφικών, αποτελεί πνευματική ιδιοκτησία της Doctor Digital ή των αντίστοιχων δικαιούχων
          και προστατεύεται από την ισχύουσα νομοθεσία περί πνευματικών δικαιωμάτων.
          Απαγορεύεται η αναπαραγωγή, αναδημοσίευση ή οποιαδήποτε άλλη χρήση χωρίς προηγούμενη έγγραφη άδεια.
        </p>

        <h2>2. Ευθύνη Χρήσης</h2>
        <p>
          Η χρήση της ιστοσελίδας γίνεται με αποκλειστική ευθύνη του χρήστη. Η Doctor Digital καταβάλλει κάθε προσπάθεια για την ακρίβεια
          και εγκυρότητα των πληροφοριών, αλλά δεν φέρει καμία ευθύνη για τυχόν σφάλματα ή παραλείψεις,
          ούτε για οποιαδήποτε ζημία προκύψει από τη χρήση αυτών των πληροφοριών.
        </p>

        <h2>3. Σύνδεσμοι σε Τρίτες Ιστοσελίδες</h2>
        <p>
          Η ιστοσελίδα μπορεί να περιλαμβάνει συνδέσμους προς τρίτες ιστοσελίδες.
          Η Doctor Digital δεν ευθύνεται για το περιεχόμενο ή τις πρακτικές απορρήτου αυτών των ιστοσελίδων.
        </p>

        <h2>4. Τροποποιήσεις Όρων</h2>
        <p>
          Η Doctor Digital διατηρεί το δικαίωμα να τροποποιεί οποτεδήποτε τους παρόντες Όρους Χρήσης.
          Οι χρήστες οφείλουν να ελέγχουν περιοδικά τη σελίδα για τυχόν αλλαγές.
          Η συνέχιση της χρήσης της ιστοσελίδας μετά από αλλαγές θεωρείται αποδοχή των τροποποιημένων όρων.
        </p>

        <h2>5. Εφαρμοστέο Δίκαιο</h2>
        <p>
          Οι παρόντες όροι διέπονται από το ελληνικό δίκαιο. Οποιαδήποτε διαφορά υπάγεται στην αποκλειστική αρμοδιότητα των δικαστηρίων Αθηνών.
        </p>
      </div>
    </div>
  );
}
